/*
 Разработать шаблон структуры данных в памяти. Тип хранимого элемента - параметр
 шаблона. Шаблон содержит объект. Реализовать операции включения/удаления по
 заданному логическому номеру, поиск минимального/максимального, включение с
 сохранением порядка, сортировки выбором или вставками, загрузки хранимых
 элементов в структуру данных из последовательного потока. Проверить работу
 шаблона на разра- ботанном классе, используя его как параметр шаблона.
 Структура данных: односвязный список, элемент списка хранит непосредственно
 объект.
 */
#include <print>

int main()
{
	std::println("Hello World!");
	return 0;
}
